; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	image1 - mode
	thermograph2 - mode
	image0 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(have_image Star8 image0)
	(have_image Star9 thermograph2)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 image1)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 image0)
	(have_image Star16 thermograph2)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 10
3. (turn_to satellite2 phenomenon17 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon17)
   goals met: 0 of 10
4. (take_image satellite2 phenomenon17 instrument2 image0)
   added: (have_image phenomenon17 image0)
   goals met: 1 of 10
5. (turn_to satellite2 phenomenon15 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 10
6. (take_image satellite2 phenomenon15 instrument2 image0)
   added: (have_image phenomenon15 image0)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 10
8. (take_image satellite2 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 3 of 10
9. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 10
10. (take_image satellite2 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 4 of 10
11. (turn_to satellite2 phenomenon11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 10
12. (take_image satellite2 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 10
13. (turn_to satellite2 planet10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet10)
   goals met: 5 of 10
14. (take_image satellite2 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 6 of 10
15. (turn_to satellite2 planet12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet12)
   goals met: 6 of 10
16. (take_image satellite2 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 10
17. (turn_to satellite2 star16 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star16)
   goals met: 7 of 10
18. (take_image satellite2 star16 instrument2 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 8 of 10
19. (turn_to satellite2 star8 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star8)
   goals met: 8 of 10
20. (take_image satellite2 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 9 of 10
21. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 9 of 10
22. (take_image satellite2 star9 instrument2 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 10 of 10
